tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "archey"
brew "autoconf"
brew "automake"
brew "bamtools"
brew "bash"
brew "bash-completion"
brew "bench"
brew "bork"
brew "cabextract"
brew "freetype"
brew "gettext"
brew "pixman"
brew "cairo"
brew "readline"
brew "calc"
brew "ccrypt"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "cscope"
brew "ctags"
brew "openssl"
brew "elinks"
brew "exiftool"
brew "faac"
brew "lame"
brew "xvid"
brew "ffmpeg"
brew "findutils"
brew "flac"
brew "fortune"
brew "fzf"
brew "gmp"
brew "gawk"
brew "gcc"
brew "gd"
brew "geoip"
brew "pcre2"
brew "git"
brew "git-secrets"
brew "gnuplot"
brew "libunistring"
brew "nettle"
brew "gnutls"
brew "go"
brew "grep"
brew "hdf5"
brew "htop"
brew "hub"
brew "little-cms2"
brew "imagemagick"
brew "mas"
brew "moreutils"
brew "mysql"
brew "neovim"
brew "ninja"
brew "openssh"
brew "pandoc"
brew "pkg-config"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "speedtest-cli"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "wine"
brew "winetricks"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "cjbassi/gotop/gotop"
cask "alfred"
cask "arduino"
cask "atom"
cask "balenaetcher"
cask "bettertouchtool"
cask "cheatsheet"
cask "cleanmymac"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "iina"
cask "malwarebytes"
cask "mendeley"
cask "skype"
cask "spotify"
cask "steam"
cask "telegram"
mas "1Password 7", id: 1333542190
mas "Agenda", id: 1287445660
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "NordVPN IKE", id: 1116599239
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shazam", id: 897118787
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
