# https://github.com/Homebrew/homebrew-bundle

tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
cask "java"


# Homebrew
# https://github.com/Homebrew/brew/


# Early necessary dependency
brew "coreutils"
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "ack"
brew "archey"
brew "readline"
brew "gettext"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bamtools"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bench"
brew "bork"
brew "cabextract"
brew "freetype"
brew "pixman"
brew "cairo"
brew "calc"
brew "libunistring"
brew "nettle"
brew "gnutls"
brew "emacs"
brew "cask"
brew "ccrypt"
brew "cmake"
brew "cowsay"
brew "cscope"
brew "ctags"
brew "dark-mode"
brew "elinks"
brew "little-cms2"
brew "exiftool"
brew "faac"
brew "lame"
brew "xvid"
brew "ffmpeg"
brew "gcc"
brew "findutils"
brew "pcre2"
brew "fish"
brew "flac"
brew "fortune"
brew "gawk"
brew "gd"
brew "geoip"
brew "git"
brew "git-secrets"
brew "gmp" # Vim dependency
brew "libxml2"
brew "gnuplot"
brew "go"
brew "pkg-config"
brew "goto"
brew "jasper"
brew "libtool", args: ["universal"]
brew "grep"
brew "gsl"
brew "icu4c"
brew "node"
brew "heroku"
brew "hh"
brew "htop"
brew "httpie"
brew "hdf5"
brew "ifstat"
brew "imagemagick"
brew "irssi"
brew "libav"
brew "libevent"
brew "libusb"
brew "libusb-compat"
brew "libgphoto2"
brew "libicns", args: ["universal"]
brew "librsvg"
brew "libyaml"
brew "lynis"
brew "m-cli"
brew "magic-wormhole"
brew "makedepend"
brew "mas"
brew "mitmproxy"
brew "moreutils"
brew "mplayer"
brew "mpv"
brew "mysql"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "net-snmp"
brew "nmap"
brew "openssh"
brew "p7zip"
brew "pianobar"
brew "pipes-sh"
brew "pv"
brew "pycodestyle"
brew "qt"
brew "pyqt"
brew "qt@5.5"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "root"
brew "rtv"
brew "ruby"
brew "ruby-build"
brew "sane-backends"
brew "sassc"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "shpotify"
brew "speedtest-cli"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "trinity"
brew "ttfautohint"
brew "unrar"
brew "utf8proc"
brew "valgrind"
brew "vimpager"
brew "watch"
brew "wget"
brew "wine"
brew "winetricks"
brew "wxpython"
brew "z"
brew "zenity"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zzuf"


# -------------------------------------------------------------------
# Homebrew cask
# -------------------------------------------------------------------
cask "alfred"
cask "atom"
cask "arduino"
cask "carbon-copy-cloner"
cask "cleanmymac"
cask "coderunner"
cask "dash"
cask "dropbox"
cask "discord"
cask "eagle"
cask "etcher"
cask "evernote"
cask "fantastical"
cask "firefox"
cask "flash"
cask "flux"
cask "fritzing"
cask "gifrocket"
cask "gitkraken"
cask "iterm2"
cask "macdown"
cask "macvim"
cask "malwarebytes"
cask "mendeley"
cask "processing"
cask "screenflow"
cask "skype"
cask "spotify"
cask "stremio"
cask "telegram"
cask "time-lapse-assembler"
cask "tunnelbear"
cask "vivaldi"
cask "vlc"
cask "vuze"
cask "whatsapp"
cask "homebrew/cask-fonts/font-fira-code"
cask "homebrew/cask-fonts/font-hack-nerd-font"


# -------------------------------------------------------------------
# Mas installs
# -------------------------------------------------------------------
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Fenêtre", id: 1286743037
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Mermoz", id: 418060227
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Video Format Converter", id: 994845396
mas "Watch TV", id: 870158157
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
