tap "felixkratz/formulae"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "antidote"
brew "xz"
brew "little-cms2"
brew "bash"
brew "bash-completion"
brew "openssl@3"
brew "bat"
brew "freetype"
brew "gettext"
brew "pcre2"
brew "readline"
brew "pixman"
brew "cairo"
brew "ccrypt"
brew "gmp"
brew "coreutils"
brew "exiftool"
brew "fd"
brew "flac"
brew "libunistring"
brew "nettle"
brew "gnutls"
brew "lame"
brew "xvid"
brew "ffmpeg"
brew "gawk"
brew "gcc"
brew "gd"
brew "gh"
brew "git"
brew "glow"
brew "pinentry"
brew "gnupg"
brew "go"
brew "grep"
brew "pkg-config"
brew "hdf5"
brew "htop"
brew "libomp", link: true
brew "imagemagick"
brew "keychain"
brew "ldns"
brew "libgit2"
brew "llvm"
brew "lsd"
brew "mas"
brew "moreutils"
brew "ncdu"
brew "neovim"
brew "openblas"
brew "openssh"
brew "pinentry-mac"
brew "postgresql@14"
brew "rlwrap"
brew "rsync"
brew "ruby"
brew "ssh-copy-id", link: true
brew "starship"
brew "streamlink"
brew "tokei"
brew "trash"
brew "vim"
brew "wget"
brew "xdg-ninja"
brew "yt-dlp"
brew "zsh"
brew "zsh-completions"
cask "balenaetcher"
cask "blender"
cask "cernbox"
cask "discord"
cask "docker"
cask "firefox"
cask "flux"
cask "font-computer-modern"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "gpg-suite"
cask "iina"
cask "iterm2"
cask "mactex-no-gui"
cask "obs"
cask "processing"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "steam"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "zoom"
cask "zotero"
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Agenda", id: 1287445660
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "formulahendry.code-runner"
vscode "fortran-lang.linter-gfortran"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "kosz78.nim"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nimsaem.nimvscode"
vscode "pkief.material-icon-theme"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "valentjn.vscode-ltex"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vkbo.madx"
vscode "waderyan.gitblame"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
