tap "cjbassi/gotop"
tap "esimov/triangle"
tap "eth-p/software"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "khanhas/tap"
tap "louisbrunner/valgrind"
tap "orf/brew"
brew "ack"
brew "archey"
brew "openssl@1.1"
brew "aria2"
brew "autoconf"
brew "automake"
brew "bamtools"
brew "bash"
brew "bash-completion"
brew "bash-snippets"
brew "bat"
brew "bench"
brew "bit-git"
brew "boost"
brew "bork"
brew "cabextract"
brew "freetype"
brew "gettext"
brew "readline"
brew "xz"
brew "pixman"
brew "cairo"
brew "calc"
brew "ccrypt"
brew "cgdb"
brew "clinfo"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "cscope"
brew "ctags"
brew "diff-so-fancy"
brew "elinks"
brew "exa"
brew "exiftool"
brew "faac"
brew "fd"
brew "flac"
brew "gmp"
brew "libunistring"
brew "pkg-config"
brew "nettle"
brew "gnutls"
brew "lame"
brew "little-cms2"
brew "xvid"
brew "ffmpeg"
brew "ffsend"
brew "findutils"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gd"
brew "gdb"
brew "geckodriver"
brew "geoip"
brew "gh"
brew "gifski"
brew "pcre2"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "git-quick-stats"
brew "git-secrets"
brew "pinentry"
brew "gnupg"
brew "gnupg@1.4", link: false
brew "gnuplot"
brew "go"
brew "grafana"
brew "grep"
brew "hdf5"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "keychain"
brew "libscalene", args: ["HEAD"]
brew "llvm"
brew "lynx"
brew "magic-wormhole"
brew "mas"
brew "mercurial"
brew "ninja"
brew "moreutils"
brew "mysql"
brew "ncdu"
brew "neovim"
brew "nim"
brew "nmap"
brew "onefetch"
brew "openssh"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "postgresql"
brew "ranger"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "shellcheck"
brew "speedtest-cli"
brew "ssh-copy-id", link: true
brew "starship"
brew "streamlink"
brew "textql"
brew "tokei"
brew "torsocks"
brew "trash"
brew "tree"
brew "triangle"
brew "vim"
brew "wget"
brew "wine"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "cjbassi/gotop/gotop"
brew "eth-p/software/bat-extras"
brew "heroku/brew/heroku"
brew "jesseduffield/lazydocker/lazydocker"
brew "khanhas/tap/spicetify-cli"
brew "louisbrunner/valgrind/valgrind", args: ["HEAD"]
brew "orf/brew/gping"
cask "arduino"
cask "balenaetcher"
cask "crunch"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "gpg-suite"
cask "iina"
cask "mattermost"
cask "postman"
cask "processing"
cask "spotify"
cask "steam"
cask "telegram"
cask "wireshark"
cask "zoom"
cask "zoomus"
cask "zotero"
mas "1Password 7", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Agenda", id: 1287445660
mas "Gifski", id: 1351639930
mas "Glance", id: 1513574319
mas "iMovie", id: 408981434
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "NordVPN IKE", id: 1116599239
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
