tap "caarlos0/tap"
tap "cjbassi/gotop"
tap "cmacrae/formulae"
tap "esimov/triangle"
tap "eth-p/software"
tap "fortran-lang/fortran"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "khanhas/tap"
tap "louisbrunner/valgrind"
tap "orf/brew"
brew "ack"
brew "freetype"
brew "gettext"
brew "pcre2"
brew "pkg-config"
brew "pixman"
brew "readline"
brew "xz"
brew "cairo"
brew "little-cms2"
brew "archey"
brew "aria2"
brew "gmp"
brew "gcc"
brew "openblas"
brew "autoconf"
brew "automake"
brew "bamtools"
brew "bash"
brew "bash-completion"
brew "bash-snippets"
brew "bat"
brew "bit-git"
brew "libomp", link: true
brew "blast"
brew "boost"
brew "bork"
brew "btop"
brew "cabextract"
brew "calc"
brew "ccrypt"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "libunistring"
brew "diff-so-fancy"
brew "difftastic"
brew "elinks"
brew "enchant"
brew "exa"
brew "exiftool"
brew "faac"
brew "fd"
brew "flac"
brew "nettle"
brew "gnutls"
brew "lame"
brew "xvid"
brew "ffmpeg"
brew "ffsend"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gd"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-quick-stats"
brew "git-secrets"
brew "glow"
brew "glpk"
brew "pinentry"
brew "gnupg"
brew "gnupg@1.4"
brew "gnupg@2.2"
brew "gnuplot"
brew "go"
brew "graphviz"
brew "grep"
brew "hatch"
brew "hdf5"
brew "hexyl"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "juliaup"
brew "just"
brew "keychain"
brew "ldns"
brew "llvm"
brew "lsd"
brew "magic-wormhole"
brew "node"
brew "marp-cli"
brew "mas"
brew "moreutils"
brew "mysql"
brew "ncdu"
brew "neovim"
brew "nim"
brew "ninja"
brew "nnn"
brew "octave"
brew "onefetch"
brew "openssh"
brew "openssl@3"
brew "optipng"
brew "pandoc"
brew "pinentry-mac"
brew "podman"
brew "postgresql@14"
brew "qalculate-gtk"
brew "ranger"
brew "rbenv"
brew "rclone"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "ruby"
brew "ruff"
brew "speedtest-cli"
brew "ssh-copy-id", link: true
brew "starship"
brew "streamlink"
brew "tealdeer"
brew "terminal-notifier"
brew "textql"
brew "tokei"
brew "torsocks"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "xdg-ninja"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "caarlos0/tap/timer"
brew "cjbassi/gotop/gotop"
brew "eth-p/software/bat-extras"
brew "fortran-lang/fortran/fpm"
cask "arduino"
cask "balenaetcher"
cask "blender"
cask "cernbox"
cask "discord"
cask "docker"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "gpg-suite"
cask "iina"
cask "inkscape"
cask "iterm2"
cask "julia"
cask "mactex-no-gui"
cask "netron"
cask "notion"
cask "obs"
cask "processing"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "steam"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "zoom"
cask "zotero"
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
vscode "bungcip.better-toml"
vscode "Catppuccin.catppuccin-vsc"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "James-Yu.latex-workshop"
vscode "julialang.language-julia"
vscode "kosz78.nim"
vscode "marp-team.marp-vscode"
vscode "mblode.zotero"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "nimsaem.nimvscode"
vscode "PKief.material-icon-theme"
vscode "valentjn.vscode-ltex"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vkbo.madx"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
